pinafore> )
<input>:1:1: unexpected: ")"; expecting: end of input, expression
pinafore> (
<input>:1:1: unexpected: "("; expecting: end of input, expression
pinafore> in
<input>:1:1: unexpected: "in"; expecting: end of input, expression
pinafore> a
<input>:2:1: undefined: a:a
pinafore> a
<input>:2:1: undefined: a:a
pinafore> let p = q
pinafore> p
<input>:3:1: undefined: q:a
pinafore> a
<input>:3:1: undefined: a:a
pinafore> p
<input>:3:1: undefined: q:a
pinafore> openEntity @X !"x"
<input>:2:13: unknown type: X
pinafore> let y = openEntity @Y !"y"
<input>:2:21: unknown type: Y
pinafore> 35
35
pinafore> x + 1
<input>:4:1: undefined: x:Integer
pinafore> x + y
<input>:4:1: undefined: x:Integer, y:Integer
pinafore> <END>
