pinafore> :doc length.Text
#| The length of a text.
pinafore> :doc Time
#| Absolute time as measured by UTC.
pinafore> :doc Just
#| Construct a Maybe from a value.
pinafore> import "pinafore-gnome"
pinafore> import "pinafore-media"
pinafore> with Cairo
pinafore> :doc paintAlpha.Drawing
#| Paint everywhere with this alpha (within the clip)
pinafore> :doc Element.GTK
#| A user interface element is something that goes inside a window.
pinafore> :doc textArea.GTK
#| Text area, unknown reference will be interpreted as empty text, but the element will not delete the reference.
pinafore> :doc notfound
! notfound undefined
pinafore> let aa = 8
pinafore> :doc aa
pinafore> let {#| doc 1 xx #} xx: Integer = 45
pinafore> :doc xx
#| doc 1 xx
pinafore> let {#| doc 2 yy #} yy = 57
pinafore> :doc yy
#| doc 2 yy
pinafore> :doc xx
#| doc 1 xx
pinafore> let {# plain comment #} zz = 12
pinafore> :doc zz
pinafore> let {#| doc 3 T #} opentype T
pinafore> :doc T
#| doc 3 T
pinafore> <END>
