pinafore> )
<input>:1:1: syntax: unexpected: ")"; expecting: end of input, pattern, expression
pinafore> (
<input>:1:1: syntax: expecting: expression
pinafore> a
<input>:2:1: undefined: a: a
pinafore> a
<input>:2:1: undefined: a: a
pinafore> p = q
<input>:1:5: undefined: q: a
pinafore> p
<input>:2:1: undefined: p: a
pinafore> a
<input>:2:1: undefined: a: a
pinafore> p
<input>:2:1: undefined: p: a
pinafore> point.OpenEntity @X !"x"
<input>:1:19: undefined: X
pinafore> y = point.OpenEntity @Y !"y"
<input>:1:23: undefined: Y
pinafore> 35
35
pinafore> x +.Integer 1
<input>:3:1: undefined: x: Integer
pinafore> x +.Integer y
<input>:3:1: undefined: x: Integer, y: Integer
pinafore> datatype D1 +a {MkD1 b}
<input>:1:1: unbound type variables in declaration of D1: b
pinafore> datatype D2 +a +a {MkD2}
<input>:1:1: duplicate type variables in declaration of D2: a
pinafore> datatype D3 +a -a {MkD3}
<input>:1:1: duplicate type variables in declaration of D3: a
pinafore> ?param
<input>:3:1: unimplied: ?param: a
pinafore> ?pp + 2
<input>:3:1: unimplied: ?pp: Integer
pinafore> <END>
